{
	"@metadata": {
		"authors": [
			"Amire80",
			"Kipod",
			"Umherirrender",
			"Wugpodes"
		]
	},
	"chessbrowser-desc": "{{desc|name=ChessBrowser|url=https://www.mediawiki.org/wiki/Extension:ChessBrowser}}\n\n\"PGN\" is [[:w:en:Portable Game Notation|Portable Game Notation]].",
	"chessbrowser-invalid-message": "Message shown in place of an invalid PGN",
	"chessbrowser-invalid-category": "Tracking category for pages with invalid PGNs",
	"chessbrowser-invalid-category-desc": "Description on [[Special:TrackingCategories]] for the {{msg-mw|chessbrowser-invalid-category}} tracking category.",
	"chessbrowser-expand-button": "Button label which shows additional content on click",
	"chessbrowser-game-detail": "Information about the game such as players, date, result, etc.",
	"chessbrowser-event-label": "The tournament or event during which the game was played",
	"chessbrowser-site-label": "The location at which the game was played",
	"chessbrowser-date-label": "The date the game was played",
	"chessbrowser-round-label": "For tournaments, what round of the tournament the game was played during",
	"chessbrowser-white-label": "The player who controlled the white pieces",
	"chessbrowser-black-label": "The player who controlled the black pieces",
	"chessbrowser-result-label": "Whether the game resulted in a win, loss, draw, or is still in progress",
	"chessbrowser-notations-label": "Accessibility description of the set of controls to move through the various chess moves",
	"chessbrowser-first-rank": "{{optional}}\nLabel for the first row of the chess board",
	"chessbrowser-second-rank": "{{optional}}\nLabel for the second row of the chess board",
	"chessbrowser-third-rank": "{{optional}}\nLabel for the third row of the chess board",
	"chessbrowser-fourth-rank": "{{optional}}\nLabel for the fourth row of the chess board",
	"chessbrowser-fifth-rank": "{{optional}}\nLabel for the fifth row of the chess board",
	"chessbrowser-sixth-rank": "{{optional}}\nLabel for the sixth row of the chess board",
	"chessbrowser-seventh-rank": "{{optional}}\nLabel for the seventh row of the chess board",
	"chessbrowser-eighth-rank": "{{optional}}\nLabel for the eighth row of the chess board",
	"chessbrowser-a-file": "{{optional}}\nLabel for the first file (top to bottom) of the chess board",
	"chessbrowser-b-file": "{{optional}}\nLabel for the second file (top to bottom) of the chess board",
	"chessbrowser-c-file": "{{optional}}\nLabel for the third file (top to bottom) of the chess board",
	"chessbrowser-d-file": "{{optional}}\nLabel for the fourth file (top to bottom) of the chess board",
	"chessbrowser-e-file": "{{optional}}\nLabel for the fifth file (top to bottom) of the chess board",
	"chessbrowser-f-file": "{{optional}}\nLabel for the sixth file (top to bottom) of the chess board",
	"chessbrowser-g-file": "{{optional}}\nLabel for the seventh file (top to bottom) of the chess board",
	"chessbrowser-h-file": "{{optional}}\nLabel for the eighth file (top to bottom) of the chess board",
	"chessbrowser-beginning-of-game": "Label for button which navigates to first move of game.\n\nShould be similar to {{msg-mw|Chessbrowser-end-of-game}}.",
	"chessbrowser-previous-move": "Label for button which goes one move back",
	"chessbrowser-slow-autoplay": "Label for button which slows down automatic moves",
	"chessbrowser-play-pause-button": "Label for button which starts or stops the automatic moves",
	"chessbrowser-fast-autoplay": "Label for button which speeds up the automatic moves",
	"chessbrowser-next-move": "Label for button which goes to the next move",
	"chessbrowser-end-of-game": "Label for button which goes to the last move of the game.\n\nShould be similar to {{msg-mw|Chessbrowser-beginning-of-game}}.",
	"chessbrowser-flip-board": "Label for button which switches whether the white or black pieces are on the bottom of the board",
	"chessbrowser-no-javascript": "Text displayed if the user does not have JavaScript enabled",
	"chessbrowser-boardstate-initial": "Accessibility description of the state of the board being the initial state.",
	"chessbrowser-boardstate-final": "Accessibility description of the state of the board being the final state.",
	"chessbrowser-boardstate-check": "'''This doesn't mean \"verify\"!'''\n\n'''This is a term in the game of chess when the king is under threat!'''\n\nSee [[:w:en:Check (chess)|Check (chess)]] in Wikipedia.\n\nAccessibility description of the state of the board when in check.",
	"chessbrowser-boardstate-checkmate": "Accessibility description of the state of the board when in checkmate.",
	"chessbrowser-castling-queenside": "See [[:w:en:Castling|Castling]] in Wikipedia.\n\nAccessibility description of move where someone castles queenside.",
	"chessbrowser-castling-kingside": "See [[:w:en:Castling|Castling]] in Wikipedia.\n\nAccessibility description of move where someone castles queenside.",
	"chessbrowser-piece-white-king": "Name of chesspiece King for player with white pieces, used in accessibility description of moves",
	"chessbrowser-piece-white-queen": "Name of chesspiece Queen for player with white pieces, used in accessibility description of moves",
	"chessbrowser-piece-white-bishop": "Name of chesspiece Bishop for player with white pieces, used in accessibility description of moves",
	"chessbrowser-piece-white-knight": "Name of chesspiece Knight for player with white pieces, used in accessibility description of moves",
	"chessbrowser-piece-white-rook": "Name of chesspiece Rook for player with white pieces, used in accessibility description of moves",
	"chessbrowser-piece-white-pawn": "Name of chesspiece Pawn for player with white pieces, used in accessibility description of moves",
	"chessbrowser-piece-black-king": "Name of chesspiece King for player with black pieces, used in accessibility description of moves",
	"chessbrowser-piece-black-queen": "Name of chesspiece Queen for player with black pieces, used in accessibility description of moves",
	"chessbrowser-piece-black-bishop": "Name of chesspiece Bishop for player with black pieces, used in accessibility description of moves",
	"chessbrowser-piece-black-knight": "Name of chesspiece Knight for player with black pieces, used in accessibility description of moves",
	"chessbrowser-piece-black-rook": "Name of chesspiece Rook for player with black pieces, used in accessibility description of moves",
	"chessbrowser-piece-black-pawn": "Name of chesspiece Pawn for player with black pieces, used in accessibility description of moves",
	"chessbrowser-move": "Accessibility description of chess move.\n\nParameters:\n* $1 - The name of the chesspiece making the move, like King.\n* $2 - An optional specifier of rank and/or file to param $1\n* $3 - The rank and file where the chesspiece moves to, like A3.",
	"chessbrowser-capture": "Accessibility description of chess move where you capture a piece.\n\nParameters:\n* $1 - The name of the chesspiece making the move, like King.\n* $2 - An optional specifier of rank and/or file to param $1\n* $3 - The rank and file of the chesspiece being captured, like A3.",
	"chessbrowser-promote": "Accessibility description of chess move where a pawn reaches the opposing side and promotes to become another piece. See [[:w:en:Promotion (chess)|Promotion (chess)]].\n\n$1 - the name of the piece being promoted to.",
	"chessbrowser-black-moves": "Accessibility description of the side that is about to move. Followed by either {{msg-mw|chessbrowser-move}}, {{msg-mw|chessbrowser-capture}}, {{msg-mw|chessbrowser-castling-kingside}} or {{msg-mw|chessbrowser-castling-queenside",
	"chessbrowser-white-moves": "Accessibility description of the side that is about to move. Followed by either {{msg-mw|chessbrowser-move}}, {{msg-mw|chessbrowser-capture}}, {{msg-mw|chessbrowser-castling-kingside}} or {{msg-mw|chessbrowser-castling-queenside",
	"chessbrowser-chessboard-label": "Acessibility label for the chessboard itself.",
	"chessbrowser-empty-square": "Accessibility label for an empty square of the chessboard. Parameter $1, the position on the board. Check the Wikipedia article [[:en:Chessboard|Chessboard]] for the terminology for \"square\" in your language.",
	"chessbrowser-occupied-black": "{{optional}}\nAccessibility label for a square occupied by a black piece.\n\nParameters:\n* $1 - Name of the chesspiece\n* $2 - Position of the chesspiece",
	"chessbrowser-occupied-white": "{{optional}}\nAccessibility label for a square occupied by a white piece.\n\nParameters:\n* $1 - Name of the chesspiece\n* $2 - Position of the chesspiece"
}
